from math import *
from pprint import *

a = 'но на этот раз караван задерживался. Задерживался непозволительно долго, так что уже становилось ясно: произошло нечто ужасное, непредвиденное, от чего не сумели защитить ни закалённые в боях тяжеловооружённые конвоиры, ни годами налаживавшиеся отношения с руководством Ганзы.'
a = a.lower()
mass = {}
for i in a:
    if i not in mass:
        mass[i] = a.count(i)

newmass = {}
for i in mass:
    newmass[i] = mass[i] / len(a)

pprint(newmass)
# 1) {'н': 0.08695652173913043, 'о': 0.11231884057971014, ' ': 0.12681159420289856, 'а': 0.07246376811594203, 'э': 0.0036231884057971015, 'т': 0.04710144927536232, 'р': 0.03260869565217391, 'з': 0.025362318840579712, 'к': 0.018115942028985508, 'в': 0.04710144927536232, 'д': 0.025362318840579712, 'е': 0.06884057971014493, 'ж': 0.025362318840579712, 'и': 0.057971014492753624, 'л': 0.03985507246376811, 'с': 0.036231884057971016, 'я': 0.025362318840579712, '.': 0.007246376811594203, 'З': 0.0036231884057971015, 'п': 0.010869565217391304, 'ь': 0.010869565217391304, 'г': 0.010869565217391304, ',': 0.014492753623188406, 'ч': 0.010869565217391304, 'у': 0.018115942028985508, ':': 0.0036231884057971015, 'ш': 0.010869565217391304, 'м': 0.010869565217391304, 'щ': 0.0036231884057971015, 'ё': 0.007246376811594203, 'ы': 0.014492753623188406, 'б': 0.0036231884057971015, 'х': 0.0036231884057971015, 'Г': 0.0036231884057971015}

h = - sum([newmass[i] * log2(newmass[i]) for i in newmass]) # Шенона на 1 символ
print(h)

# 2) 4.382962014216633

print(h * len(a)) # Шенона на текст
# 3) 1209.6975159237907

h2 = log2(len(newmass)) * len(a) # Хартли для текста
print(h2)
# 4) 1380.0
